Revit 2027 API
ParameterTypeId.DuctRoughness Property
 "Roughness"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DuctRoughness { get; }
Public Shared ReadOnly Property DuctRoughness As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DuctRoughness {
	ForgeTypeId^ get ();
}
static member DuctRoughness : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace